Revit 2026 API

# BuiltInFailuresPathFailures Class

---

Failures about Path.

SystemObject Autodesk.Revit.DBBuiltInFailuresPathFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PathFailures
```
```vb
Public NotInheritable Class PathFailures
```
```cpp
public ref class PathFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PathFailures = class end
```

The BuiltInFailuresPathFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Path3dRegenError | Picked Path could not be regenerated. |

#### Reference

Autodesk.Revit.DB Namespace